Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
ied                  = "2025-08-25T08:48:17.459+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] is tainted, so must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3990690605240843461" -> (known after apply)
      ~ triggers = {
          ~ "timestamp" = "1758162473455304000" -> "1758166581945793000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (deposed object 91238e89) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8852114330341970823" -> null
      - triggers = {
          - "filename"  = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip"
          - "timestamp" = "1756111466863931000"
        } -> null
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ last_modified                  = "2025-09-18T02:31:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "wbWOKtiRxwdYi0MLSJZg4MURLrzPR1dteMhBoohkdx0=" -> "uJXbksQ1WQyVPVyJUvqmlllNEMW5PctKlrQDjL4sOi8="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (deposed object cdc864f9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4695511287234543700" -> null
      - triggers = {
          - "filename"  = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
          - "timestamp" = "1756111467369546000"
        } -> null
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ last_modified                  = "2025-09-18T02:31:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "gSCwdyHESFBR6SKZyerYYYAzLVhyT/Yh9ozG1NsAGXg=" -> "9UN0XEpRmr66QuCVBfhD08UfSs7D7sK9qGBDneaJhx4="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (deposed object 92766352) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "9210519233497162754" -> null
      - triggers = {
          - "filename"  = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
          - "timestamp" = "1756111467767656000"
        } -> null
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ last_modified                  = "2025-09-18T02:31:22.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "cJVKOjVFutUtJ/uEDHxq43nBcKcRAhL2VwQuqm7OLAo=" -> "d01wxbW5o+NyE+zvLhholJYwZUqTfZ+iDs4vpZggbJw="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (deposed object f48254af) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "798892279029106317" -> null
      - triggers = {
          - "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
          - "timestamp" = "1756111467139458800"
        } -> null
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-09-18T02:31:44.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "W8rv8fbgUsJA6+YjOe/Dz91w49sj3YyOurwI2WS792g=" -> "FgCeJ/DJtKdUtPi6wkMNtHXEFwgRUu5mTgMZDM6ygwc="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] (deposed object 91168d04) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7695704126110082091" -> null
      - triggers = {
          - "filename"  = "builds/19039ae9583ed19cd0983db81dd4c9470a66bd4082d06488091b82fef2205c71.zip"
          - "timestamp" = "1756111467862540000"
        } -> null
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ last_modified                  = "2025-09-18T02:31:28.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "6pknwowVcLlBKqPv1Br0Syye1RR2m4nbjT2qxpju5S0=" -> "wWoqd2pkTlxro9zYSEA3jH0bA3Z2AgtkSFQAF4IpFSw="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (deposed object ee1488e3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6782779297099141204" -> null
      - triggers = {
          - "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          - "timestamp" = "1756111466446140000"
        } -> null
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ last_modified                  = "2025-09-18T02:31:28.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "jnrQkQObW7aKdeQwg7j1KgaR0vX1V3rkhLsYqo8vUYY=" -> "A//DvtsyLJI1Y9U93AEP71z2ajKKkSrXO/315m696ek="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (deposed object 2a4b13de) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6785143689445204482" -> null
      - triggers = {
          - "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          - "timestamp" = "1756111467234299800"
        } -> null
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ last_modified                  = "2025-09-18T02:31:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "fPToeBNrm/V5pIZMDGvIWBqigiXycasjaCrCoGD8LbE=" -> "gWntMtDypbx0vp0SzGJ39Q2d9+kQtTph6zt9LvPJzPY="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (deposed object 2f5df225) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8126604345263468201" -> null
      - triggers = {
          - "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          - "timestamp" = "1756111466851289000"
        } -> null
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ last_modified                  = "2025-09-18T02:31:40.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "lEK+v/IOOfV0NpcxNouffr0jioPwFfGXx95b+Gw57Qk=" -> "FWZbvnfaKANhBHASl6Fh1iYhODDSQxACUxnUluDBlso="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (deposed object d07b6153) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3581614039743005051" -> null
      - triggers = {
          - "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          - "timestamp" = "1756111466070144800"
        } -> null
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ last_modified                  = "2025-09-18T02:31:22.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "yBCsoLR6AKmS/L6+QaayUH2uYUBwmE7/tmcJUvjg0nM=" -> "xlomsuGsHVhtcpbl+72YZJCz+46bZGdL+/YCEMvosPk="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (deposed object a3a35e77) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5474086431704061865" -> null
      - triggers = {
          - "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
          - "timestamp" = "1756111466422108000"
        } -> null
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ last_modified                  = "2025-09-18T02:31:28.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "4t8toFhq2ACAnnIiFMN8wMT+k3ZUI/DZhZ2+V9lT+MU=" -> "k5krFaGYPa7bgNsGcxYlytYjsN0aCfImbutU7kc1Gmo="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] (deposed object 397bde8f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3453720856251484229" -> null
      - triggers = {
          - "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          - "timestamp" = "1756111467025538000"
        } -> null
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ last_modified                  = "2025-09-18T02:31:27.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "hrcz7MS3S2ncypuVveJnw8qQc0C8mf0h7+/lb+4QGIQ=" -> "rnjOfPe3dGKpvyH6igYx3hUsDh979u0onYkmFQV05PM="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (deposed object ec04f045) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2775195517508396128" -> null
      - triggers = {
          - "filename"  = "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip"
          - "timestamp" = "1756111467153059000"
        } -> null
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ last_modified                  = "2025-09-18T02:31:38.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "MWeFltVmfxjDzICAXX4grZS3WAw87iQerFoJ/0IamPw=" -> "+e6jYVRi5Z4FPqPaBESWUN32CVsFyMORK6zZ3R8PfB4="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (deposed object ead21274) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1066526251903281085" -> null
      - triggers = {
          - "filename"  = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
          - "timestamp" = "1756111467742392000"
        } -> null
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ last_modified                  = "2025-09-18T02:31:22.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "IUOLT9tTzPgJk/THkNpuOHSLQYLOlBSiWhOQgHx2qPE=" -> "Y14zIo60sX0Nu0KFuDwu+ccBdFIw7uRqjIZ9eY+hcr0="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] (deposed object ae3e3146) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8216712083802810948" -> null
      - triggers = {
          - "filename"  = "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip"
          - "timestamp" = "1756111466964541000"
        } -> null
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ last_modified                  = "2025-09-18T02:31:22.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "7lKpu73cF0JUV35asydqr8bVCt222lNUsnmW8hMUaRU=" -> "7hfY2XxGXAlCCMfH83XOmegnESI+4wv65bfy+kKBEHA="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (deposed object ef8b6178) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "463124308843956021" -> null
      - triggers = {
          - "filename"  = "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip"
          - "timestamp" = "1756111467762225000"
        } -> null
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ last_modified                  = "2025-09-18T02:31:32.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "cSC4MxU8uppYXowvQ5564Grks5jY/QqLzhU5b9E/wyU=" -> "t+Z5VSHJQ6bOWnTMyK6kiyQsUFOQT/l6WNK5YsFcdwM="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (deposed object 5634d349) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1098694622364436976" -> null
      - triggers = {
          - "filename"  = "builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip"
          - "timestamp" = "1756111467366813800"
        } -> null
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ last_modified                  = "2025-09-18T02:31:28.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "4ruNlBrsw7dLj1TIdM4zHcJbCJ2M8tcNxKCqNkRgXcw=" -> "or2K2htCai1E1a1r+hHrEYqvoOFKNKFgLUKH27qSolk="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13" -> (known after apply)
      ~ code_sha256                 = "j6k0ZtYHmMBI3Z2T9yd5io9BErCYIHYqkmwSInbHb1I=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-18T02:31:22.392+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:13" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> "builds/38569e7cc54e0cefdd63c946edba1912f3e212277e4629dde03bcc0897ceedfe.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24398600 -> (known after apply)
      ~ version                     = "13" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] (deposed object f5bff3a6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12" -> null
      - code_sha256                 = "i/7ThOHl2+kyodyc5uJgOrNmCMMPN7xZPSGbpIcDIBc=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-25T08:48:27.133+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:12" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer" -> null
      - layer_name                  = "sbeacon_backend_python_libraries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gasi-lambda-layers-20250513021721893000000003" -> null
      - s3_key                      = "builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 24397892 -> null
      - version                     = "12" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "e955d8d9d4d6ac72acc00ef0ea27d3ab-5" -> (known after apply)
      ~ id                            = "gasi-lambda-layers-20250513021721893000000003/builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> (known after apply)
      ~ key                           = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> "builds/38569e7cc54e0cefdd63c946edba1912f3e212277e4629dde03bcc0897ceedfe.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> "builds/38569e7cc54e0cefdd63c946edba1912f3e212277e4629dde03bcc0897ceedfe.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] (deposed object dc315be3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - bucket                        = "gasi-lambda-layers-20250513021721893000000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "binary/octet-stream" -> null
      - etag                          = "66d3501d559cc4d1e2b2d59e27cb8117-5" -> null
      - force_destroy                 = false -> null
      - id                            = "gasi-lambda-layers-20250513021721893000000003/builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - key                           = "builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] must be replaced
+/- resource "local_file" "archive_plan" {
      ~ content              = jsonencode(
          ~ {
              ~ filename      = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> "builds/38569e7cc54e0cefdd63c946edba1912f3e212277e4629dde03bcc0897ceedfe.zip"
                # (3 unchanged attributes hidden)
            } # forces replacement
        )
      ~ content_base64sha256 = "98up+9bDUi6tPrs2yQnjL02niHrJz1Elm/OzZkWnvio=" -> (known after apply)
      ~ content_base64sha512 = "TWxJMV0or1sGZ5+xWaKIVMzMMNa+d/7C4Ogv/zeNnbDgd3pel8i+9d5XrHd1jZRzyXE70wnGtK9Nrijvb5GbCA==" -> (known after apply)
      ~ content_md5          = "097b513e093c0977e52b45530e8eb476" -> (known after apply)
      ~ content_sha1         = "6e4b418d1e47f0a34bd56ef9ffbb378699d5cb1b" -> (known after apply)
      ~ content_sha256       = "f7cba9fbd6c3522ead3ebb36c909e32f4da7887ac9cf51259bf3b36645a7be2a" -> (known after apply)
      ~ content_sha512       = "4d6c49315d28af5b06679fb159a28854cccc30d6be77fec2e0e82fff378d9db0e0777a5e97c8bef5de57ac77758d9473c9713bd309c6b4af4dae28ef6f919b08" -> (known after apply)
      ~ filename             = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.plan.json" -> "builds/38569e7cc54e0cefdd63c946edba1912f3e212277e4629dde03bcc0897ceedfe.plan.json" # forces replacement
      ~ id                   = "6e4b418d1e47f0a34bd56ef9ffbb378699d5cb1b" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2605805055030014666" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/146ce8c1c2211ece470966661adcfa55bfabfada5c69bc6001be022c8aefd799.zip" -> "builds/38569e7cc54e0cefdd63c946edba1912f3e212277e4629dde03bcc0897ceedfe.zip"
          ~ "timestamp" = "1758162488744781000" -> "1758166605424798000"
        }
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] (deposed object 694ccc60) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5872406833242066383" -> null
      - triggers = {
          - "filename"  = "builds/3561ae79de6e4055e129534af3823910859d2d0e4711b6a12881aa70715f8c36.zip"
          - "timestamp" = "1756111483687374200"
        } -> null
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] (deposed object 98e12c51) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9" -> null
      - code_sha256                 = "tPhy3AhPs1GB5jppSj5ezhRSKVFJqq18K3yXrRVYrgY=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-25T08:48:20.619+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:9" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer" -> null
      - layer_name                  = "sbeacon_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "gasi-lambda-layers-20250513021721893000000003" -> null
      - s3_key                      = "builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 120494 -> null
      - version                     = "9" -> null
        # (5 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] (deposed object 20cd83fe) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gasi-lambda-layers-20250513021721893000000003/builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - bucket                        = "gasi-lambda-layers-20250513021721893000000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "68fd54265ea1cf5ec94d3d6652b543c5" -> null
      - force_destroy                 = false -> null
      - id                            = "gasi-lambda-layers-20250513021721893000000003/builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - key                           = "builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {
          - "Environment" = "uat"
          - "NAME"        = "sbeacon-backend"
          - "Owner"       = "gaspi"
        } -> null
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] (deposed object dbe51a8e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1049456738398553898" -> null
      - triggers = {
          - "filename"  = "builds/0734f5877e1e9dad6e8bf79d27e9cb360903b26d528706e609ffd47b61ea9029.zip"
          - "timestamp" = "1756111466663596000"
        } -> null
    }

  # module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "security-sendSecurityAlert"
      ~ last_modified                  = "2025-08-25T08:48:17.249+0000" -> (known after apply)
      ~ source_code_hash               = "vAREHgtm3igUkU5+Tgy9ogm2J5yIO3KZYPxrvrxcnhw=" -> "8tmUQBHplWaDUlPZS1z/gfHv6IIjTJAqvFDURRDVpSQ="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "security-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this (deposed object 02d70864) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:5472cf0eab296dc8deab8e4e3e6af0cbf62b5d8ffef5f71915852fec454c4fd1" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
      - sha256_digest        = "sha256:7432ace85e05f3f4fab8960016d2411abb3d87befd6c0f5a523c12752934b21a" -> null
      - triggers             = {
          - "dir_sha" = "d89093227325fa7ea1c3d445e2bd7934726d6ca0"
        } -> null
    }

  # module.svep[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchStarter"
      ~ last_modified                  = "2025-09-18T02:31:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "oBLHUdYI5U6tD5DLh7ad3OkC0FVpwfKyesdYZBHUDAI=" -> "rKzdcMLRkmbhRm+lfn2bZVtVSBTBfE2HEI3VqFRsoQ8="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-batchSubmit"
      ~ last_modified                  = "2025-09-18T02:30:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "LOwZa42jYIr+C/9Htb9tC3jcFUc6dtCJRI4vjAtoSHc=" -> "cVkZ7XYaUwNmGAzWRqHNovAlW8v0xTYoqM/0LqF+sqs="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-batchSubmit.null_resource.archive[0] (deposed object 04170820) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7909297504390108772" -> null
      - triggers = {
          - "filename"  = "builds/f2196129bfbee99ecf4aca7f82dcf5aab08821f9add856de80b9801d4f700067.zip"
          - "timestamp" = "1756111471769906000"
        } -> null
    }

  # module.svep[0].module.lambda-clearTempAndRegions.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-clearTempAndRegions"
      ~ last_modified                  = "2025-08-25T08:48:17.717+0000" -> (known after apply)
      ~ source_code_hash               = "CpkbLXQUQvE9H0xQyh06MsBg5YrULxaY/Mz6gMHH8UA=" -> "D83PnZZaME/iuZwiG3Y6Xb7QA4gIJUv8YpLeyyaYw5g="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concat"
      ~ last_modified                  = "2025-09-18T02:31:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "oIF3k3ZzlVv/YD7QNK8aarqv5ivPidKUefF0WpdB+fI=" -> "fAKrE7NTPvl+Rl8uS/Xe3IDw5c5OnMqMeYjjUrfjlEc="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatPages"
      ~ last_modified                  = "2025-09-18T02:31:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "6BqbzIObgeYqWQ9ARSEaOiz6I/TfkNvLxtlrnR8koJg=" -> "iOQT9jqhHHQ8/oNpmPbzjjybG6kzxiy89i406P/MDRk="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-concatStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-concatStarter"
      ~ last_modified                  = "2025-09-18T02:31:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "XLekBiTOZq9B+nWIp1sb77eX6tgch6i4VS7Zd2iuLCc=" -> "UXXmwCv2d5hmi7U45RpdxRFp1k1UbDek8nqzen/yD0g="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-createPages.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-createPages"
      ~ last_modified                  = "2025-09-18T02:31:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "b5swotPZnc5abiqZD9LJFOL10cRS/CdJFKaRQfLbjDU=" -> "s2gT5J3Zp9fbiHsjmUApz3r0KVlZujMR9Q3pduDlO44="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-deleteClinicalWorkflow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-deleteClinicalWorkflow"
      ~ last_modified                  = "2025-09-18T02:31:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "InEzJJWIFPgpXVhUIcgki6OWCAx1d7XALIdCPPVFekE=" -> "2sIvmQzyVmsT1Avnjk5tBRMjEMH1oK0piRk8DbBMSXk="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-formatOutput.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-formatOutput"
      ~ last_modified                  = "2025-09-18T02:31:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "bRvYCkm2h23lDXQXESQU7858Ab97H06I4JsutrMrb/0=" -> "RjZX+N7V/8EKvDCmpT8kANCdCChNFvhM2sW3+Z7f8UA="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-getResultsURL"
      ~ last_modified                  = "2025-09-18T02:30:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ck2RZukNom3MxLIoFeQJQnlziP5O9T8bamzRJY23rKM=" -> "V8aMNqrgEzc4KZKVZ8BPynMq/gJm4Mz3Vhrk956P6i8="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-getResultsURL.null_resource.archive[0] (deposed object cedd1070) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4509652308501032224" -> null
      - triggers = {
          - "filename"  = "builds/dbf46123a8a5c0d713d746ad3c23e8bf26d84a39a32d052a473dc7c1116f5191.zip"
          - "timestamp" = "1756111472429896200"
        } -> null
    }

  # module.svep[0].module.lambda-initQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-initQuery"
      ~ last_modified                  = "2025-09-18T02:31:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "lGEDvlA+ZQpvhe+9dRyYwqEjRwS3isC8oH+1W7t/uZg=" -> "/2Yxa/lQywZtmFQ1qdIkGz3Aw8I3hQGMSVVRSFWVsf4="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-initQuery.null_resource.archive[0] (deposed object 9035b989) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "136244236526779431" -> null
      - triggers = {
          - "filename"  = "builds/949b43e6d8737b29b6fbf3b078adba05455ab5cebab437aaa6c6a9c4e30f399e.zip"
          - "timestamp" = "1756111472029106000"
        } -> null
    }

  # module.svep[0].module.lambda-pluginClinvar.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginClinvar"
      ~ last_modified                  = "2025-09-18T02:31:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "lSjY4T22GBQXMsh+vE2GsKTSwIHC6NJN8V1PtY1iG/o=" -> "oRAqB5txWtVGw8jT3U3ED2FS0IW1KEUmQOy+5gztA4g="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomad"
      ~ last_modified                  = "2025-09-18T02:31:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "C8t5p5lc4vlgVNAMcrbYRZYk55Iakl8DWbaNHTpZtzk=" -> "yuBkL7gpRO8VKBkjmw0zmW6tH9AyxpkwZ5gSZbdXk0Y="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadConstraint.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomadConstraint"
      ~ last_modified                  = "2025-09-18T02:31:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "qVYtYjVesW0nQLSwofZBTl8XbLdzKOgSBCMFrJQb55w=" -> "nk5NPZFZPv/bb/1JuDm7k0DFZ7QHtICFszpteMUXr8M="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-pluginGnomadOneKG.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginGnomadOneKG"
      ~ last_modified                  = "2025-09-18T02:31:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "epKleLIZX/XbX4WTIklYUrQivf1zgM2tKEWyKGbQRbU=" -> "/jDuIaK0StngauvpHQ11BQfiJ+D9ALTa7S0BCaipvag="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcNotes"
      ~ last_modified                  = "2025-09-18T02:31:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "1T+L8wMBnADwTv/tJgi1AQGqyd1yEu+cghIxmOSLLRE=" -> "YDEEBtd/ITFqe/W2n02Ue4TJ7362LKJNBJumiY8+Pvs="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-qcNotes.null_resource.archive[0] (deposed object 518908ce) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1612385254487562686" -> null
      - triggers = {
          - "filename"  = "builds/7bb413b7579a5a9ccb874b45fe277268f7765ee27a3c08ee225800932d871c7c.zip"
          - "timestamp" = "1756111472514987000"
        } -> null
    }

  # module.svep[0].module.lambda-queryGTF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryGTF"
      ~ last_modified                  = "2025-09-18T02:31:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "SDw+vIi2iZv7uJ99FdS7bByVIm4rxiKNBgF7QuSNA0k=" -> "NFyTqtPKBs3TKshOMEeND88+Co1W/Pz8/rpZAJ3wYFA="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCF.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCF"
      ~ last_modified                  = "2025-09-18T02:31:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "MG5sxu8AXQIuAOxQiE3E+ERB189TzmsZ9p+8H/Y8gTE=" -> "EMB7hnLWhuq89ac0i2ZisfYMeTLGuzj8UjYz5m6B7QE="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-queryVCFsubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-queryVCFsubmit"
      ~ last_modified                  = "2025-09-18T02:31:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "Z+ktxl5CZ3qp8nXGB0EV3J1Wcaul2oZCgSj7eAqZ8Cs=" -> "vvbPXzW/iazEzsUFBC++Oa6fsZK7iRPE4COWHfBqCO4="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-sendJobEmail"
      ~ last_modified                  = "2025-09-18T02:31:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "fI93xBh8tnFXBxogFngeO/aqJ9aAxJ/8o/IsPgLGcss=" -> "QddGkhumU5xk7ioJHq3d2ulAkjqzfvlm+7g70WACArY="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-updateReferenceFiles"
      ~ last_modified                  = "2025-09-18T02:31:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ri4FPkWsHpyOgNZIot25hcka3V4l/qzn11Rq3q7j3aI=" -> "i+oUNZl5YGgEdoHIoCzG/NWX0/J/inVriWNTSbeCaHg="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "svep-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0] (deposed object 19633dac) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:16" -> null
      - code_sha256                 = "Amq1IkgWmJL5tXM4aJTntQZPjhOTezvOThv/P3TJF6A=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-25T08:48:21.106+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer:16" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_python_modules_layer" -> null
      - layer_name                  = "svep_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "svep-backend-layers-20250815040234005900000003" -> null
      - s3_key                      = "builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 37622 -> null
      - version                     = "16" -> null
        # (5 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.aws_s3_object.lambda_package[0] (deposed object 4dfa7b5a) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::svep-backend-layers-20250815040234005900000003/builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> null
      - bucket                        = "svep-backend-layers-20250815040234005900000003" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "e77c0b610e9db1644fc3da17c0f11a3b" -> null
      - force_destroy                 = false -> null
      - id                            = "svep-backend-layers-20250815040234005900000003/builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> null
      - key                           = "builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
        # (14 unchanged attributes hidden)
    }

  # module.svep[0].module.python_modules_layer.null_resource.archive[0] (deposed object 6b39be94) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1762326486056651827" -> null
      - triggers = {
          - "filename"  = "builds/71090d73cba690f281ba4ba5f074f900cda728e272fe99eebf365b57cf2a1980.zip"
          - "timestamp" = "1756111471821086000"
        } -> null
    }

Plan: 8 to add, 48 to change, 44 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: uat03-plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "uat03-plan.out"
✅ Terraform plan created successfully: uat03-plan.out
ℹ️  Plan summary:

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.sbeacon.aws_lambda_layer_version.binaries_layer (deposed object 4561c3d2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "binaries_layer" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:9" -> null
      - code_sha256                 = "0sdaIDREVWtyxVsqKU9Zm2Bzzf1WzwGV9F0tVfSKdpc=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-25T08:48:03.559+0000" -> null
ℹ️  Cleaning up sensitive files and configurations
ℹ️  Removing temporary files: *.out
✅ Cleanup completed
✅ ============================================================
✅ Atlantis plan completed successfully for uat03!

Thank you for using Atlantis Schema Deploy
© September, 2025 GXC Consortium
✅ Main execution completed successfully
ℹ️  ============================================================
ℹ️  SCRIPT EXECUTION SUMMARY
ℹ️  ============================================================
ℹ️  Environment: uat03
ℹ️  Operation: plan
ℹ️  Exit Code: 0
ℹ️  Duration: 1142s
ℹ️  Timestamp: 2025-09-18T03:39:23Z
✅ Deployment completed successfully! 🎉
ℹ️  Cleaning up sensitive files and configurations
✅ Cleanup completed
✅ Script completed successfully
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gxc-uat03
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-gxc.xapiens.id/lock?id=GSI-Xapiens-CSIRO%252FBGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gxc-uat03
  ```
Plan: 8 to add, 48 to change, 44 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```